[
    {
        "Text": "If you want to make an apple pie from scratch you must first create the universe.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Were made of star stuff. We are a way for the cosmos to know itself.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "For small creatures such as we the vastness is bearable only through love.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Every one of us is you will not find another.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "For me however satisfying and reassuring.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Science is a way of thinking much more than it is a body of knowledge.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Imagination will often carry us to worlds that never were. But without it we go nowhere.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "We live in a society exquisitely dependent on science and technology in which hardly anyone knows anything about science and technology.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "We are like butterflies who flutter for a day and think it is forever.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Somewhere something incredible is waiting to be known.",  
"Source":"Carl Sagan"  
    },
 
 
    {
        "Text": "The nitrogen in our DNA the carbon in our apple pies were made in the interiors of collapsing stars. We are made of starstuff.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Science is not only compatible with spirituality; it is a profound source of spirituality.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "A book is made from a tree. It is an assemblage of flat who never knew one another. Books break the shackles of time ― proof that humans can work magic.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "For me however satisfying and reassuring.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Extraordinary claims require extraordinary evidence.",  
"Source":"Carl Sagan"  
    },
 
 
    {
        "Text": "In science it often happens that scientists say because scientists are human and change is sometimes painful. But it happens every day. I cannot recall the last time something like that happened in politics or religion.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "For me however satisfying and reassuring.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "I would love to believe that when I die I will live again I know of nothing to suggest that it is more than wishful thinking.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "But the fact that some geniuses were laughed at does not imply that all who are laughed at are geniuses. They laughed at Columbus they laughed at the Wright brothers. But they also laughed at Bozo the Clown.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "We can judge our progress by the courage of our questions and the depth of our answers our willingness to embrace what is true rather than what feels good.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "We are like butterflies who flutter for a day and think it is forever.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "The universe is a pretty big place. If it’s just us seems like an awful waste of space.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "You’re an interesting species. An interesting mix. You’re capable of such beautiful dreams is each other.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Frederick Douglass taught that literacy is the path from slavery to freedom. There are many kinds of slavery and many kinds of freedom but reading is still the path.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "How is it that hardly any major religion has looked at science and concluded that stressed the magnificence of the Universe as revealed by modern science might be able to draw forth reserves of reverence and awe hardly tapped by the conventional faiths.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "The nuclear arms race is like two sworn enemies standing waist deep in gasoline the other with five.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "The truth may be puzzling. It may take some work to grapple with. It may be counterintuitive. It may contradict deeply held prejudices. It may not be consonant with what we desperately want to be true. But our preferences do not determine what’s true.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "For small creatures such as we the vastness is bearable only through love.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "It is far better to grasp the universe as it really is than to persist in delusion however satisfying and reassuring.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "I can find in my undergraduate classes or even that the Sun is a star.",  
"Source":"Carl Sagan"  
    },

 
    {
        "Text": "Personally if it gave me a chance to discover how history turns out.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Skeptical scrutiny is the means by which deep thoughts can be winnowed from deep nonsense.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "If we long to believe that the stars rise and set for us does science do us a disservice in deflating our conceits?",
    "Source":"Carl Sagan" 
    },
 
    {
        "Text": "We have also arranged things so that almost no one understands science and technology. This is a prescription for disaster. We might get away with it for a while but sooner or later this combustible mixture of ignorance and power is going to blow up in our faces.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "The universe seems neither benign nor hostile merely indifferent.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "A celibate clergy is an especially good idea because it tends to suppress any hereditary propensity toward fanaticism.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "All of the books in the world contain no more information than is broadcast as video in a single large American city in a single year. Not all bits have equal value.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "When you make the finding yourself – even if you’re the last person on Earth to see the light – you’ll never forget it.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "The brain is like a muscle. When it is in use we feel very good. Understanding is joyous.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "We’ve arranged a civilization in which most crucial elements profoundly depend on science and technology.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "I am often amazed at how much more capability and enthusiasm for science there is among elementary school youngsters than among college students.",  
"Source":"Carl Sagan"  
    },
    {
        "Text": "More Carl Sagan quotes about life and the universe.",  
"Source":"Carl Sagan"
    },
 
    {
        "Text": "If you wish to make an apple pie from scratch you must first invent the universe.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Absence of evidence is not evidence of absence.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "But the fact that some geniuses were laughed at does not imply that all who are laughed at are geniuses. They laughed at Columbus they laughed at the Wright Brothers. But they also laughed at Bozo the Clown.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "There are naive questions questions put after inadequate self-criticism. But every question is a cry to understand the world. There is no such thing as a dumb question.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "But I try not to think with my gut. If I’m serious about understanding the world is likely to get me into trouble.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "Our species needs a citizenry with minds wide awake and a basic understanding of how the world works.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "What a marvelous cooperative arrangement – plants and animals each inhaling each other’s exhalations the entire elegant cycle powered by a star 150 million kilometers away.",  
"Source":"Carl Sagan"  
    },
 
    {
        "Text": "If God is omnipotent and omniscient if there was any competition.",  
"Source":"Carl Sagan"  
    }
]